In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
pd.read_table('ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
# if we have data with no row and columns
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_csv('ex2.csv', names=['a', 'b', 'c', 'd', 'message'], index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [7]:
pd.read_csv('ex3.csv', names=['a', 'b', 'c', 'd', 'message'], skiprows=[0, 2, 3])

   a  b  c  d message
0  5  6  7  8   world

In [8]:
result = pd.read_csv('ex4.csv')
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [9]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [10]:
result = pd.read_csv('ex4.csv', na_values=['NULL'], parse_dates=True)
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [17]:
# Reading text files in pieces

In [15]:
# reading small pieces of file
pd.options.display.max_rows = 10

In [16]:
result = pd.read_csv('ex4.csv')
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [19]:
result = pd.read_csv('ex4.csv', nrows=5)
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6   7   8   world
2     three  9  10  11  12     foo

In [20]:
# reading in chunk
chunker = pd.read_csv('ex4.csv', chunksize=1000)
chunker

In [28]:
tot = pd.Series([], dtype='int')
for price in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)
tot

Series([], dtype: int64)

In [31]:
# Writing Data to text format
data = pd.read_csv('ex1.csv')
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [32]:
data.to_csv('output.csv')

In [33]:
# to print text 
import sys

In [34]:
data.to_csv(sys.stdout, sep='|')

|a|b|c|d|message
0|1|2|3|4|hello
1|5|6|7|8|world
2|9|10|11|12|foo

In [35]:
data.to_csv(sys.stdout, na_rep = 'Null')

,a,b,c,d,message
0,1,2,3,4,hello
1,5,6,7,8,world
2,9,10,11,12,foo

In [36]:
#working with delimiters

In [37]:
import csv
f = open('ex5.csv')

In [38]:
reader = csv.reader(f)
reader

In [39]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']